{
  "architectures": [
    "ZhinaoForCausalLM"
  ],
  "auto_map": {
    "AutoConfig": "configuration_zhinao.ZhinaoConfig",
    "AutoModelForCausalLM": "modeling_zhinao.ZhinaoForCausalLM"
  },
  "bf16": true,
  "fp16": false,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.01,
  "intermediate_size": 11008,
  "max_position_embeddings": 4096,
  "model_max_length": 4096,
  "model_type": "zhinao",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 32,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.38.2",
  "use_cache": false,
  "use_flash_attn": "auto",
  "vocab_size": 158464
}
