{
    "_name_or_path": "openbmb/MiniCPM-V-2",
    "architectures": [
      "MiniCPMV"
    ],
    "attention_bias": false,
    "attention_dropout": 0.0,
    "auto_map": {
      "AutoConfig": "configuration_minicpm.MiniCPMVConfig",
      "AutoModel": "modeling_minicpmv.MiniCPMV",
      "AutoModelForCausalLM": "modeling_minicpmv.MiniCPMV"
    },
    "bos_token_id": 1,
    "dim_model_base": 256,
    "drop_vision_last_layer": true,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 2304,
    "image_size": 448,
    "initializer_range": 0.1,
    "intermediate_size": 5760,
    "max_position_embeddings": 4096,
    "max_slice_nums": 9,
    "mm_use_im_start_end": true,
    "model_type": "minicpmv",
    "num_attention_heads": 36,
    "num_hidden_layers": 40,
    "num_key_value_heads": 36,
    "patch_size": 14,
    "pretraining_tp": 1,
    "query_num": 64,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "rope_theta": 10000.0,
    "scale_depth": 1.4,
    "scale_emb": 12,
    "scale_resolution": 448,
    "slice_mode": true,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.36.0",
    "use_cache": true,
    "vision_encoder": "vit_so400m_patch14_siglip_384.webli",
    "vocab_size": 122753
  }
  